In [18]:
import numpy as np
import pandas as pd
# 看成一个定长的有序字典 创建了 顺序是固定的
s1 = pd.Series([4,7,-5,3])  #创建一个series，索引为默认值
print(s1)

s1.values
s1.index

s2 = pd.Series([4.0,3,1,2,],index=['d','b','a','c'])
print(s2)
s2['d']
'b' in s2
'c' in s2

#DataFrame
data = {'year':[2014,2015,2016,2017],
        'income':[1000,2000,3000,4000],
        'pay':[500,1000,1500,2000]}
df1 = pd.DataFrame(data)
df1

0    4
1    7
2   -5
3    3
dtype: int64
d    4.0
b    3.0
a    1.0
c    2.0
dtype: float64

   year  income   pay
0  2014    1000   500
1  2015    2000  1000
2  2016    3000  1500
3  2017    4000  2000

In [16]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [17]:

df3 = pd.DataFrame(np.arange(12).reshape(3,4),index=['a','b','c'],columns=[11,12,13,14])
df3

   11  12  13  14
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11